/*-----------------------------------------------------------------------------------------------------
【平    台】CCS
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2021年2月24日13:12:44
-------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------
超声波测试例程
TRIG P1.6
ECHO P1.7
-------------------------------------------------------------------------------------------------------*/
#include "exinlibs\headfile.h"
float distance=0;
void distance_SHOW()
{
    OLED_Show_String(0,0,"HCSR04 TEST DEMO",8);
    OLED_Show_String(0,1,"dis:",8);
    OLED_Show_float(40,1,distance,2,8);
    OLED_Show_String(82,1," cm",8);
}
void main()
{
    system_init(1);//初始化滴答计时器
    set_DCO_48MH();
    OLED_init();//OLED初始化
    HC_SR04_init();
    while(1)
    {
       distance=HC_SR04_dis();
       distance_SHOW();
    }
}
