/*-----------------------------------------------------------------------------------------------------
【平    台】CCS
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2021年12月19日10:36:25
-------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------
串口测试
引脚:launch pad USB
开始后将从电脑接收到的数据传回电脑
电脑波特率选择115200
-------------------------------------------------------------------------------------------------------*/
#include "exinlibs\headfile.h"

void main()
{
    system_init(0);
    set_DCO_48MH();
    key_init(KEY1|KEY2);
    UART_init(UART0,115200);//初始化串口0，对应launchpad usb接口 波特率115200
    delay_ms(1000);
    UART_send_string(UART0,"HELLO_EXIN\n");
    while(1)
    {
        if(!key_get(KEY1))
        {
            delay_ms(10);
            if(!key_get(KEY1)){UART_send_short(UART0,0x3ff3);}//发送一个16位
            while(!key_get(KEY1));
        }
        else if(!key_get(KEY2))
       {
           delay_ms(10);
           if(!key_get(KEY2)){UART_send_int(UART0,0x12433ff3);}//发送一个32位
           while(!key_get(KEY2));
       }
    }
}
