/*-----------------------------------------------------------------------------------------------------
【平    台】CCS
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2021年12月16日19:12:14
-------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------
ADC0832读写例程
需要将开发板上J1跳线端接至H，来访问ADC0832

此例程将采集CH2通道采集的ad值发送至山外上位机进行波形显示
-------------------------------------------------------------------------------------------------------*/
#include "exinlibs\headfile.h"

unsigned char txt_ADC0832[20]={};



uint8  ADC_dat;//存放4个通道的AD转换值

char buf[5]={0};

void Oscill_send(unsigned char data)
{
    buf[0] = 0x03;
    buf[1] = 0xfc;
    buf[2] = data;
    buf[3] = 0xfc;
    buf[4] = 0x03;
    UART_send_string(EUSCI_A0_BASE,buf);
}


void main()
{
    system_init(0);
    UART0_init();
   //ADC引脚初始化
    ADC0832_init(CH2);
    while(1)
    {
        ADC_dat = ADC0832_read_Byte(CH2 , SINGLE , 0);//CH2通道  单通道  开启校验
        Oscill_send(ADC_dat);
    }
}


