/*-----------------------------------------------------------------------------------------------------
【平    台】CCS
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2021年12月18日19:54:45
-------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------
 蜂鸣器测试例程
-------------------------------------------------------------------------------------------------------*/
#include "exinlibs\headfile.h"

#define Buzzer_PORT          GPIO_PORT_P9
#define Buzzer_PIN           GPIO_PIN1  //P9.1

void main()
{
    system_init(0);
    set_DCO_48MH();
    gpio_init(Buzzer_PORT,Buzzer_PIN,GPO,0);//初始化蜂鸣器引脚
    while(1)
    {
        delay_ms(250);
        gpio_toggle(Buzzer_PORT,Buzzer_PIN);//翻转电平
    }
}

